## SQLite-tehtävät

#### Tehtävä 1. Lisää tarvittavat kirjastot ja tee `testi.db` niminen tietokanta (SQLite3)

In [1]:
import sqlite3

In [2]:
database_connection  = sqlite3.connect('testi.db')

#### Tehtävä 2. Luo yhteys tietokantaan

In [3]:
c = database_connection.cursor()

#### Tehtävä 3. Tee tietokantaan seuraavanlainen taulu, jonka nimi on `henkilotaulu`:
    
| Nimi        | Ika           | Kengankoko  |
| ------------- |-------------| -----|
| Teppo      | 88 | 47 |
| Matti      | 34     | 39 |
| Ilona | 41      |    36 |
| Sonja | 32      |    37 |

In [4]:
c.execute('''CREATE TABLE henkilotaulu
             (Nimi, Ika, Kengankoko)''')

example_data_rows = [("Teppo", 88, 47), ("Matti", 34, 39), ("Ilona", 41, 36), ("Sonja", 32, 37)]

for data_row in example_data_rows:
    c.execute('''INSERT INTO henkilotaulu VALUES {0}'''.format(data_row))
    
database_connection.commit()

OperationalError: table henkilotaulu already exists

#### Tehtävä 4. Kun Taulu on tehty, niin hae taulu Pandasin DataFrame-objektiin ja lisää siihen sarake `Hatunkoko`, jonka jälkeen täytä se valitsemillasi arvoilla

In [5]:
import pandas as pd

sql_query = '''SELECT * FROM henkilotaulu'''

dataframe_from_sqlite = pd.read_sql(sql_query, database_connection)
dataframe_from_sqlite

   index   Nimi  Ika  Kengankoko  Hatunkoko
0      0  Teppo   88          47         11
1      1  Matti   34          39         22
2      2  Ilona   41          36         33
3      3  Sonja   32          37         44

In [6]:
dataframe_from_sqlite["Hatunkoko"] = [11,22,33,44]
dataframe_from_sqlite.to_sql("henkilotaulu", con=database_connection, if_exists="replace", index=False)

In [7]:
sql_query='''SELECT * FROM henkilotaulu'''
dataframe_from_sqlite = pd.read_sql(sql_query, database_connection)

dataframe_from_sqlite

   index   Nimi  Ika  Kengankoko  Hatunkoko
0      0  Teppo   88          47         11
1      1  Matti   34          39         22
2      2  Ilona   41          36         33
3      3  Sonja   32          37         44

#### Tehtävä 5. Tee taulusta kopio, jonka nimi on `henkilotaulukopio` ja lisää siihen rivi valitsemillasi arvoilla

In [8]:
dataframe_from_sqlite = dataframe_from_sqlite.append(pd.DataFrame({"Nimi":["Jouni"], "Ika":[12], "Kengankoko":["36"], "Hatunkoko":["55"]}))

dataframe_from_sqlite.to_sql(name="henkilotaulukopio", con=database_connection, if_exists='fail', index=False)

ValueError: Table 'henkilotaulukopio' already exists.

In [10]:
sql_query = '''SELECT * FROM henkilotaulukopio'''
dataframe_from_sqlite = pd.read_sql(sql_query, database_connection)

dataframe_from_sqlite

ProgrammingError: Cannot operate on a closed database.

#### Tehtävä 6. Tallenna lopuksi tietokannan muutokset ja sulje yhteys

In [11]:
database_connection.close()